{"format": "graph-model", "generatedBy": "2.4.0-dev20200726", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"danceability:0": {"name": "danceability:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "energy:0": {"name": "energy:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "valence:0": {"name": "valence:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "time_signature:0": {"name": "time_signature:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "key:0": {"name": "key:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "loudness:0": {"name": "loudness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "mode:0": {"name": "mode:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "tempo:0": {"name": "tempo:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "speechiness:0": {"name": "speechiness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "acousticness:0": {"name": "acousticness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "instrumentalness:0": {"name": "instrumentalness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "liveness:0": {"name": "liveness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/minlength", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/minlength", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/minlength", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_2/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_2/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_3/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_3/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_4/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_4/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_5/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_5/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_6/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_6/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_7/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_7/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_8/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_8/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "acousticness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "danceability", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "energy", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "instrumentalness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "key", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "liveness", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loudness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "mode", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "speechiness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "tempo", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "time_signature", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "valence", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization/sub", "op": "Sub", "input": ["acousticness", "StatefulPartitionedCall/functional_1/normalization/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_1/sub", "op": "Sub", "input": ["danceability", "StatefulPartitionedCall/functional_1/normalization_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_2/sub", "op": "Sub", "input": ["energy", "StatefulPartitionedCall/functional_1/normalization_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_3/sub", "op": "Sub", "input": ["instrumentalness", "StatefulPartitionedCall/functional_1/normalization_3/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Shape", "op": "Shape", "input": ["key"], "attr": {"T": {"type": "DT_INT64"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Max", "op": "Max", "input": ["key", "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_4/sub", "op": "Sub", "input": ["liveness", "StatefulPartitionedCall/functional_1/normalization_4/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_5/sub", "op": "Sub", "input": ["loudness", "StatefulPartitionedCall/functional_1/normalization_5/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Shape", "op": "Shape", "input": ["mode"], "attr": {"T": {"type": "DT_INT64"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Max", "op": "Max", "input": ["mode", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_6/sub", "op": "Sub", "input": ["speechiness", "StatefulPartitionedCall/functional_1/normalization_6/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_8/sub", "op": "Sub", "input": ["tempo", "StatefulPartitionedCall/functional_1/normalization_8/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Shape", "op": "Shape", "input": ["time_signature"], "attr": {"T": {"type": "DT_INT64"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Max", "op": "Max", "input": ["time_signature", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_7/sub", "op": "Sub", "input": ["valence", "StatefulPartitionedCall/functional_1/normalization_7/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_1/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_2/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_2/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_2/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_3/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_3/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_3/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/Shape", "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/Max", "StatefulPartitionedCall/functional_1/category_encoding/bincount/add/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_4/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_4/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_4/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_5/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_5/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_5/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Shape", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Max", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/add/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_6/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_6/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_6/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_8/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_8/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_8/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Shape", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Max", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/add/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/normalization_7/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/normalization_7/sub", "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_7/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/Prod", "StatefulPartitionedCall/functional_1/category_encoding/bincount/Greater/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Prod", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Greater/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Prod", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Greater/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/Greater"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Greater"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Greater"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/Cast", "StatefulPartitionedCall/functional_1/category_encoding/bincount/add"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Cast", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/add"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Cast", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/add"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/minlength", "StatefulPartitionedCall/functional_1/category_encoding/bincount/mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/functional_1/category_encoding_1/bincount/minlength", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/functional_1/category_encoding_2/bincount/minlength", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/DenseBincount", "op": "DenseBincount", "input": ["key", "StatefulPartitionedCall/functional_1/category_encoding/bincount/Maximum", "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const_2"], "attr": {"Tidx": {"type": "DT_INT64"}, "binary_output": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/DenseBincount", "op": "DenseBincount", "input": ["mode", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Maximum", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const_2"], "attr": {"Tidx": {"type": "DT_INT64"}, "binary_output": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/DenseBincount", "op": "DenseBincount", "input": ["time_signature", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Maximum", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT64"}, "binary_output": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1/category_encoding/bincount/DenseBincount", "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/DenseBincount", "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/DenseBincount", "StatefulPartitionedCall/functional_1/normalization/truediv", "StatefulPartitionedCall/functional_1/normalization_1/truediv", "StatefulPartitionedCall/functional_1/normalization_2/truediv", "StatefulPartitionedCall/functional_1/normalization_3/truediv", "StatefulPartitionedCall/functional_1/normalization_4/truediv", "StatefulPartitionedCall/functional_1/normalization_5/truediv", "StatefulPartitionedCall/functional_1/normalization_6/truediv", "StatefulPartitionedCall/functional_1/normalization_7/truediv", "StatefulPartitionedCall/functional_1/normalization_8/truediv", "StatefulPartitionedCall/functional_1/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "12"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/concatenate/concat", "unknown_17", "unknown_18"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense/Relu", "unknown_19", "unknown_20"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 473}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/minlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Greater/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding/bincount/Const_2", "shape": [0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/minlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Greater/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_1/bincount/Const_2", "shape": [0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/minlength", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Greater/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/category_encoding_2/bincount/Const_2", "shape": [0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_1/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_2/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_2/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_3/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_3/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_4/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_4/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_5/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_5/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_6/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_6/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_7/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_7/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/normalization_8/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/normalization_8/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_17", "shape": [30, 32], "dtype": "float32"}, {"name": "unknown_18", "shape": [32], "dtype": "float32"}, {"name": "unknown_19", "shape": [32, 4], "dtype": "float32"}, {"name": "unknown_20", "shape": [4], "dtype": "float32"}]}]}