{"format": "graph-model", "generatedBy": "2.5.0-dev20210106", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"energy:0": {"name": "energy:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "valence:0": {"name": "valence:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "time_signature:0": {"name": "time_signature:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "key:0": {"name": "key:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "loudness:0": {"name": "loudness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "mode:0": {"name": "mode:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "tempo:0": {"name": "tempo:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "speechiness:0": {"name": "speechiness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "acousticness:0": {"name": "acousticness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "instrumentalness:0": {"name": "instrumentalness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "liveness:0": {"name": "liveness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "danceability:0": {"name": "danceability:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/normalization/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_2/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_2/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_3/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_3/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_4/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_4/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_5/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_5/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_6/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_6/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_7/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_7/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_8/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_8/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "acousticness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "danceability", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "energy", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "instrumentalness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "key", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "liveness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "loudness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "mode", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "speechiness", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "tempo", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "time_signature", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "valence", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/model/normalization/sub", "op": "Sub", "input": ["acousticness", "StatefulPartitionedCall/model/normalization/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_1/sub", "op": "Sub", "input": ["danceability", "StatefulPartitionedCall/model/normalization_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_2/sub", "op": "Sub", "input": ["energy", "StatefulPartitionedCall/model/normalization_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_3/sub", "op": "Sub", "input": ["instrumentalness", "StatefulPartitionedCall/model/normalization_3/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_4/sub", "op": "Sub", "input": ["liveness", "StatefulPartitionedCall/model/normalization_4/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_5/sub", "op": "Sub", "input": ["loudness", "StatefulPartitionedCall/model/normalization_5/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_6/sub", "op": "Sub", "input": ["speechiness", "StatefulPartitionedCall/model/normalization_6/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_8/sub", "op": "Sub", "input": ["tempo", "StatefulPartitionedCall/model/normalization_8/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_7/sub", "op": "Sub", "input": ["valence", "StatefulPartitionedCall/model/normalization_7/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_1/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_2/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_2/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_2/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_3/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_3/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_3/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_4/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_4/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_4/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_5/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_5/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_5/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_6/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_6/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_6/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_8/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_8/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_8/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/normalization_7/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/normalization_7/sub", "ConstantFolding/StatefulPartitionedCall/model/normalization_7/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate/concat", "op": "ConcatV2", "input": ["key", "mode", "time_signature", "StatefulPartitionedCall/model/normalization/truediv", "StatefulPartitionedCall/model/normalization_1/truediv", "StatefulPartitionedCall/model/normalization_2/truediv", "StatefulPartitionedCall/model/normalization_3/truediv", "StatefulPartitionedCall/model/normalization_4/truediv", "StatefulPartitionedCall/model/normalization_5/truediv", "StatefulPartitionedCall/model/normalization_6/truediv", "StatefulPartitionedCall/model/normalization_7/truediv", "StatefulPartitionedCall/model/normalization_8/truediv", "StatefulPartitionedCall/model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "12"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/concatenate/concat", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 637}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/normalization/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_1/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_2/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_2/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_3/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_3/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_4/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_4/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_5/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_5/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_6/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_6/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_7/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_7/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/normalization_8/Reshape", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/normalization_8/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "shape": [12, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "shape": [32, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}